fixtures/payouts.json

{
  "payouts": [
    {
      "id": 854088011,
      "status": "scheduled",
      "date": "2013-11-01",
      "currency": "USD",
      "amount": "43.12"
    },
    {
      "id": 512467833,
      "status": "failed",
      "date": "2013-11-01",
      "currency": "USD",
      "amount": "43.12"
    }
  ]
}
